Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་དུ་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time the sage was anyone else, Maudgalyāyana, do not think so.

source: དེའི་ཚེ་དེའི་དུས་ན་ཤཱ་རིའི་བུ་དྲང་སྲོང་དུ་གྱུར་ཏོ། །
en: In those days the sage was Śāriputra.

source: ང་ལས་དེ་དང་ང་དགེ་བའི་རྩ་བ་དེས་ལས་ཤེས་པ་བརྙེས་སོ། །
en: Due to those deeds and roots of virtue, I gained knowledge of karma.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ལས་ཤེས་པ་ལ་བསླབ་པར་བྱ་ཞིང་། ལས་དེ་དག་ཀྱང་བསྲེ་བར་མི་བྱ་སྟེ
en: Therefore, Maudgalyāyana, those bodhisattva great beings who wish to fully awaken to unexcelled and perfect buddhahood should train in knowledge of karma and not mix up the principles of karma.

source: གཞན་དུ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: They should also dedicate their merit toward unexcelled and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལས་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱའོ། །
en: Maudgalyāyana, in this way should bodhisattva great beings understand the knowledge of karma.

source: མཽད་གལ་གྱི་བུ་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ། ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུས་བྱས་ཤིང་གཏང་བར་དཀའ་བ་ཡང་བཏང་ལ། བྱ་དཀའ་བདག་ཀྱང་བྱས་ཏེ།
en: “Maudgalyāyana, when I was training as a bodhisattva in the past I created countless roots of virtue and underwent countless trials and deprivations in order to gain knowledge of the origin as related to knowledge of karma.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་གདུགས་གཅིག་པ། ས་རྣམས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་མྱ་ངན་མེད་པའི་དཔལ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in cyclic existence, Maudgalyāyana, long before even the distant past there was a patron-king named Aśokaśrī, who reigned over numerous regions under the single umbrella of his command.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: At that time there appeared in the world a thus-gone named Defeater of the Force of Evil.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་དུང་ཕྱུར་ཕྲག་དགུ་བྱུང་ངོ་། །
en: The blessed thus-gone Defeater of the Force of Evil had a community of nine hundred million hearers, all worthy ones whose defilements had ended.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ། ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུ་པོ་དེ་དག་གི་དབུས་སུ་བཞུགས་ནས། འདི་ལྟ་སྟེ། ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལས་བརྩམས་ཏེ། ཉན་ཐོས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Once, sitting in the midst of his nine hundred million hearers, the thus-gone Defeater of the Force of Evil gave a Dharma teaching on the topic of knowledge of the origin as related to knowledge of karma.

source: དེའི་ཚེ་འཁོར་དེ་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་སེལ་བ་ཞེས་བྱ་བ་ཞིག་འདུས་པར་གྱུར་ནས་འདུག་གོ། །
en: Present in the audience on that occasion was a bodhisattva great being named Dispeller of Suffering.

source: དེ་སྟན་ལས་ལངས་ནས་གོས་ཕྱོགས་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: He stood up from his seat, draped his shawl over one shoulder, and then he knelt on his right knee.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: With his palms together he bowed toward the blessed thus-gone Defeater of the Force of Evil, and supplicated him in the form of a song:

source: མི་དབང་ཐུགས་དག་དགེ་བས་བརྒྱན་པ་སྟེ། །འདྲེན་པ་རང་བྱུང་ལ་ནི་བདག་འདི་ཞུ། །
en: “ ‘Lord of men, your mind rich with virtue, Self-manifest guide, I ask of you:

source: མགོན་པོ་ཇི་ལྟར་སྤྱད་ན་རྣམ་འདྲེན་སྲས། །དགེ་བར་སྤྱོད་པའི་ལས་ཀྱི་རྒྱུ་འཚལ་ལགས། །
en: Protector, how should heirs of the Guide Understand the causes of good actions?

source: ཇི་ལྟར་ཆགས་བྲལ་དག་པའི་ལས་སུ་འགྱུར། །
en: “ ‘How can their conduct become pure and detached?

source: ཇི་ལྟར་དག་པའི་ལས་ཀྱིས་དགེ་བ་བསྟེན། །
en: How can they follow virtue with pure conduct?

source: ཇི་ལྟར་སྤྱད་ན་དག་པའི་ལས་ཐོབ་འགྱུར། །
en: What should they do to achieve pure action?

source: འདྲེན་པ་དག་པའི་ལས་རྒྱུ་གསུངས་ཤིག་གསུངས། །
en: O Guide, please tell the causes of pure action!

source: ཇི་ལྟར་ལས་ཀྱི་རྣམ་དག་རབ་ཏུ་ཐོབ། །
en: “ ‘How can we achieve purity of action?

source: ཇི་ལྟར་འགྲོ་བ་རྣམ་དག་ལས་མངོན་འགྱུར། །
en: How can beings make their actions pure?

source: ཇི་ལྟར་རྣམ་པར་དག་ལས་རྒྱུ་དྲན་ལགས། །
en: How can we remember the causes of pure actions?

source: རྣམ་འདྲེན་ཁ་ལོ་སྒྱུར་གཙོ་གསུངས་ཤིག་གསུངས། །
en: O Guide, foremost helmsman, please explain this!

source: མཆོག་ཏུ་དགེ་བ་ཡིད་འོང་སྤྱོད་པའི་སེམས། །སྤྱོད་པ་མཉམ་རྩོམ་ཞི་བ་དག་པའི་ལས། །མི་དབང་ཁྱོད་ཀྱི་དག་པའི་གསུང་ཐོས་ནས། །འདྲེན་པ་ཁྱོད་སྲས་བྱང་ཆུབ་རབ་ཏུ་གནས། །
en: “ ‘Lord of men, once your heirs hear your immaculate words On the attitude of pleasant, wholly virtuous conduct And pure, peaceful action , the enactment of impartial conduct, O Guide, they will be well founded in awakening.’

source: མཽད་གལ་གྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་བདུད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་དེས། བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་སེལ་བ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Maudgalyāyana, then the thus-gone Defeater of the Force of Evil replied to the bodhisattva Dispeller of Suffering,

source: མྱ་ངན་སེལ་བ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཞུགས་ཏེ།
en: ‘Dispeller of Suffering, you act to help many beings, to bring about many beings’ welfare, and because you care for beings.

source: ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི། མྱ་ངན་སེལ་བ་ལེགས་སོ་ལེགས་སོ། །
en: It is excellent that you have the thought to ask this question to the Thus-Gone One.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: So, noble son, listen well and keep what I am about to say in your heart.’

source: བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་སེལ་བས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ནས།
en: The bodhisattva Dispeller of Suffering assented and listened carefully as the Blessed One had directed.

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then proceeded:

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ང་རྒྱལ་སྤང་བ་ལ་བསླབ་པར་བྱ།
en: ‘Noble son, those bodhisattva great beings who want to fully awaken to unexcelled and perfect buddhahood should train in giving up pride.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡོན་གནས་ཡིན་པར་སེམས་ཉེ་བར་གཞག་པར་བྱ།
en: They should apply themselves to being an object of all beings’ reverence.

source: ཆོས་ཀྱི་ཀུན་དགའ་བ་ལ་ཡང་སོ་སོར་རིག་པར་བྱ།
en: They should correctly understand the joy of the Dharma.

source: བྱང་ཆུབ་སེམས་ཀྱི་ཀྱང་མི་གཏང་བར་བྱ།
en: They should never forsake the mind of awakening.

source: དགེ་བའི་བཤེས་གཉེན་ཡང་མངོན་པར་མགུ་བར་བྱ།
en: They should please their spiritual guides.

source: ཆོས་བཙལ་བ་ལ་ཡང་ཆོག་མི་ཤེས་པར་བྱ།
en: They should be indefatigable in their pursuit of the Dharma.

source: མང་དུ་ཐོས་པ་ལ་ཡང་མངོན་པར་བརྩོན་པར་བྱ།
en: They should exert themselves in extensive learning.

source: བསྟན་བཅོས་ཤིན་ཏུ་བརྟགས་པ་དག་ཀྱང་བཙལ་བར་བྱ།
en: They should seek out scriptures that are well scrutinized.

source: སོ་སོར་རྟོགས་པ་ལ་ཡང་བསླབ་པར་བྱ།
en: They should train in discernment.

source: གྲུབ་པའི་མཐའ་སོ་སོར་རྟོགས་པ་ལ་ཡང་བསླབ་པར་བྱ།
en: They should also train in discerning individual tenets.

source: ཆོ་ག་ལ་མཁས་པར་ཡང་བྱ།
en: They should be skilled in ritual service.

source: བླ་མ་ལ་གུས་པར་བྱ།
en: They should respect their teachers.

source: བླ་མ་ལ་ཞེས་མེད་པའི་ཉེ་བར་སྤྱད་པར་མི་བྱ།
en: They should never be discourteous to their teachers.

source: བླ་མའི་ཚིག་ལས་འདའ་བར་ཡང་མི་བྱ།
en: They should never go against their teachers’ words.

source: དོན་དང་ལྡན་པའི་བསྟན་བཅོས་བཙལ་བར་བྱ་ཞིང་དོན་མེད་པ་གཞན་སྤང་བར་བྱ།
en: They should seek out significant scriptures and shun the other ones that are insignificant.

source: འཇིག་རྟེན་རྒྱང་འཕེན་པའི་བསྟན་བཅོས་དང་། ཆད་པའི་ཁྲིམས་ཀྱི་བསྟན་བཅོས་དང་། བྱང་སྟེམས་ཀྱི་བསྟན་བཅོས་དང་། སྨྲ་བའི་རིག་པའི་བསྟན་བཅོས་དང་། འབྱུང་པོ་རིག་པའི་བསྟན་བཅོས་དང་། རྨུགས་བྱེད་རིག་པའི་བསྟན་བཅོས་དང་། གཞོན་ནུ་རྩེ་བའི་བསྟན་བཅོས་དང་། བཟའ་བའི་བསྟན་བཅོས་དང་། རྒྱན་པོའི་བསྟན་བཅོས་དང་། མཆོང་བའི་བསྟན་བཅོས་དང་། སྒྱུ་མ་བྱེད་པའི་བསྟན་བཅོས་དང་། ཉོ་ཚོང་གི་བསྟན་བཅོས་དང་། ཤན་པའི་བསྟན་བཅོས་དང་། ཆང་འཚོང་གི་བསྟན་བཅོས་དང་། འཁྲིག་པའི་བསྟན་བཅོས་དང་། འགྲོ་བའི་བསྟན་བཅོས་དང་། ཀུན་ཏུ་འཚོ་བ་ལ་རྨོངས་པའི་བསྟན་བཅོས་དང་། ཉལ་བའི་བསྟན་བཅོས་དང་། རེངས་བྱེད་ཀྱི་བསྟན་བཅོས་དང་། རྣམ་པར་རྨོངས་བྱེད་ཀྱི་བསྟན་བཅོས་དང་། སྦྲུལ་བཟུང་བའི་བསྟན་བཅོས་དང་། གཞན་གང་དག་དེ་ལས་གཞན་པ་གང་རྣམ་པར་ཐར་པ་དང་། མི་འཐུན་པའི་བསྟན་བཅོས་དང་། གང་ཀུན་ཏུ་རྨོངས་པར་འཇུག་པ་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པས་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Immersing themselves in the vehicle of bodhisattvas, they should shun all the Lokāyata scriptures; treatises on criminal punishment, sorcery, linguistics, and demonology; the scriptures of Jambhaka; works on children’s games, cooking, gambling, acrobatics, magic, commerce, butchery, bartending, sex, and travel; works demonstrating ignorance regarding livelihood; works on sleep or paralysis; treatises that create confusion; works on snake catching; and otherwise any treatises that are at odds with liberation and simply cause more confusion.

source: འདི་ལྟར་དེ་དག་ནི་ཐར་པ་ལ་ཐོགས་པར་གྱུར་པའི་ཕྱིར་རོ། །
en: Because these types of works are an obstruction to liberation.

source: མྱ་ངན་སེལ་བ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དེས་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ལ་མངོན་པར་བརྩོན་པར་བྱ།
en: “ ‘Furthermore, Dispeller of Suffering, bodhisattva great beings who want to fully awaken to unexcelled and perfect buddhahood should exert themselves in being generous, disciplined, and restrained.

source: སེམས་ཅན་བསྡུ་བའི་ཕྱིར་བདག་ཉིད་སྣོད་དུ་བྱ།
en: They should make themselves worthy of attracting sentient beings.

source: ཇི་ལྟར་འདིའི་ཚིག་གཟུང་བར་འགྱུར་བར་བྱ་སྟེ། རིགས་ཀྱི་བུ་ཇི་ཙམ་དུ་བག་ཙམ་ཡང་དུས་མ་ཡིན་པར་སྨྲ་བ་ནི་གཟུང་བར་མི་འགྱུར་ཏེ།
en: Their speech should in all cases be agreeable, and never in the slightest amount or manner be disagreeable, or spoken inopportunely.

source: དེ་ལྟ་བས་ན་དུས་དང་རིགས་པར་ཚིག་དབྱུང་བར་བྱའོ། །
en: Thus they should utter words that are appropriate for the occasion.’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོགས་པོ་གཉིས་ཤིག་བྱུང་སྟེ། སྔོ་བསངས་དགའ་ཞེས་བྱ་བ་དང་། བླ་མ་ཞེས་བྱ་སྟེ་དེ་གཞན་ཞིག་ན།
en: “Maudgalyāyana, once there were two friends, one named Dark Joy and the other called Guru.

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ན་འདུག་གོ། །
en: Both belonged to the king’s court.

source: གཅིག་ནི་རྒྱལ་པོ་ལ་བསྟེན། གཉིས་པ་ནི་སྨད་འཚོང་མ་ལ་བསྟེན་ཏོ། །དེ་ལ་གང་སྨད་འཚོང་མ་ལ་བསྟེན་པ་ནི་སྔོ་བསངས་དགའོ། །གང་རྒྱལ་པོ་ལ་བསྟེན་པ་དེ་ནི་བླ་མའོ། །
en: One served the king—that was Guru—and the other, Dark Joy, chased after prostitutes.

source: དེ་ལ་གང་རྒྱལ་པོ་ལ་བསྟེན་པ་སྟེན་གྲོགས་བླ་མ་དེ་ནི་རིགས་པར་སྨྲ་ཞིང་དུས་སུ་སྨྲའོ། །གང་སྨད་འཚོང་མ་ལ་བསྟེན་པ་སྟེན་གྲོགས་སྔོ་བསངས་དགའ་དེ་ནི་དུས་མ་ཡིན་པར་སྨྲ་ཞིང་། རིགས་པ་མ་ཡིན་པ་སྨྲ་སྟེ།
en: Guru, the assistant who served the king, spoke in an opportune and appropriate manner, while the one who chased after prostitutes, the assistant Dark Joy, always spoke inopportunely and inappropriately.

source: དེ་སྨད་འཚོང་མ་དེ་དག་གིས་ཆང་བླུད་ནས་ར་རོ་བར་རིག་པ་དང་། རྩྭ་སྟན་གྱིས་དཀྲིས་ནས་ལམ་གྱི་བཞི་མདོར་བོར་རོ། །
en: When the prostitutes knew he had imbibed too much wine and become drunk, they would carry him out on a straw mat and dump him on a street corner.

source: མཚུངས་པ་མ་ཡིན་པས་སློབ་མ་དེ་དུས་མ་ཡིན་པའི་ཚིག་དེ་དང་རིགས་པ་མ་ཡིན་པའི་ཚིག་དེ་ལས་ཉོན་མོངས་པར་གྱུར་ཏོ། །
en: Being so different from Guru, that young man uttered inopportune and inappropriate language, which led to him becoming further disturbed.

source: དེའི་ཚེ་དེའི་དུས་ན། སྟེན་གྲོགས་བླ་མ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་ལྟ་སྟེ།
en: In case you may think that at that time the assistant Guru was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་སྟེན་གྲོགས་བླ་མ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the assistant named Guru.

source: དེའི་ཚེ་དེའི་དུས་ན་སྟེན་གྲོགས་སྔོ་བསངས་དགའ་ཞེས་བྱ་བར་གྱུར་པ། དུས་མ་ཡིན་པར་སྨྲ་ཞིང་རིགས་པ་མ་ཡིན་པར་སྨྲ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་ལྟ་སྟེ།
en: In case you may think that at that time the assistant Dark Joy was anyone else, Maudgalyāyana, do not think so.

source: ལྷ་སྦྱིན་དེའི་ཚེ་དེའི་དུས་ན་སྟེན་གྲོགས་སྔོ་བསངས་དགའ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days the assistant named Dark Joy was Devadatta.

source: དེ་དུས་མ་ཡིན་པར་སྨྲ་བ་དེ་དང་རང་རིགས་པ་མ་ཡིན་པར་སྨྲ་བ་དེ་ལས་ཉོན་མོངས་པར་གྱུར་ཏོ། །
en: He became disturbed from using language that was inopportune and inappropriate.

source: གང་གིས་ང་བདེ་བ་ཉམས་སུ་མྱོང་བ་ནི་འདི་ལྟ་སྟེ། ངས་ཀུན་འབྱུང་བ་དུས་སུ་སྨྲས་ཤིང་རིགས་པར་སྨྲས་པ་ཡིན་ནོ། །
en: The origin of the happiness I feel lies in the fact that at that time I spoke opportunely and appropriately.

source: གང་གིས་ལྷ་སྦྱིན་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྒྱུ་ནི་འདི་ལྟ་སྟེ། དུས་མ་ཡིན་པར་སྨྲ་ཞིང་རིགས་པ་མ་ཡིན་པར་སྨྲ་བ་ཡིན་ནོ། །
en: The cause that led to the karmic ripening by which Devadatta undergoes so much suffering lies in the inopportune and inappropriate language he uttered.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་དུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: “Therefore, Maudgalyāyana, bodhisattvas should exercise themselves in knowledge of the origin as related to knowledge of karma.

source: མཽད་གལ་གྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དུས་སུ་སྨྲ་བ་ལ་ཉེ་བར་གནས་པ་དེས་ནི་དྲན་པ་རྣལ་འབྱོར་དུ་བྱས་ཏེ།
en: Maudgalyāyana, those bodhisattva great beings who live by opportune speech carry out the practice of mindfulness.

source: མཽད་གལ་གྱི་བུ་དབང་པོ་ཉེ་བར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: Maudgalyāyana, bodhisattvas who live by the strengths can be said to be conscientious.

source: དེ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དག་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: They will never decline in the qualities of a bodhisattva.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: Maudgalyāyana, what are the qualities of a bodhisattva I refer to?

source: གང་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཡོངས་སུ་མི་ཉམས་པར་བྱ་བ་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: They are what a bodhisattva should never allow to decline, namely the six perfections: the perfection of generosity, the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of concentration, and the perfection of insight.

source: མཽད་གལ་གྱི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ཡིན་ཏེ།
en: Maudgalyāyana, these are qualities of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་ཡོངས་སུ་ཉམས་པར་མི་བྱའོ། །
en: Bodhisattvas should never let them decline.

source: བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་ལ་ཉེ་བར་གནས་པ་ནི་གཏོང་བ་རྗེས་སུ་དྲན་པ་བསྒོམས་ཏེ། སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Bodhisattvas who live by mindfulness train in remembering to give.

source: སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡོངས་སུ་རྫོགས་ན་སེར་སྣ་ཟློག་སྟེ།
en: In this way they perfect the meritorious activity of generosity and thus counteract stinginess.

source: གང་སེར་སྣ་བཟློགས་པས་གཏོང་བ་འཛིན་ཏོ། །
en: Those who counteract stinginess uphold generosity.

source: དེ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་དེ། གང་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དེ་འཆིང་བ་གཅོད་དོ། །
en: They have no concerns of possessing anything, and those who have no concerns of possessing anything cut their fetters.

source: གང་འཆིང་བ་གཅོད་པ་དེ་ཐར་པའོ། །
en: Those who cut their fetters are liberated,

source: གང་ཐར་པ་ནི་གྲོལ་བའོ། །
en: and those who are liberated are free.

source: གྲོལ་བ་དེ་ནི་མངོན་པར་ཞེན་པ་མེད་ཅིང་ཕུང་པོ་ལྷག་མ་མེད་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: Those who are free are beyond observation and pass beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: མཽད་གལ་གྱི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་མི་འཆིང་། ཡོངས་སུ་མི་ཉམས་པར་བྱེད་པའོ། །
en: Maudgalyāyana, these are the qualities of bodhisattvas: bodhisattvas are bound by nothing and never regress.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་ཉམས་པ་མེད་པ་ན། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུའི་ཚོགས་རྣམས་ཀྱིས་སྟོན་པར་རིག་པར་བྱ།
en: Maudgalyāyana, because bodhisattvas never regress, they should be regarded as teachers by the whole world including gods, and all other beings such as demons, Brahmā, mendicants, and brahmins.

source: འདྲེན་པར་རིག་པར་བྱ། ཡོངས་སུ་འདྲེན་པར་རིག་པར་བྱ། སྒྲོན་མ་འཛིན་པར་རིག་པར་བྱ། སྣང་བ་བྱས་པ་རིག་པར་བྱ། དེ་བཞིན་དུ་སྦྱར་ཏེ་གསལ་བར་བྱེད་པ་དང་། སྟོན་པ་དང་། ཁྲིད་པར་བྱེད་པ་དང་། ཞི་བར་བྱེད་པ་དང་། རབ་ཏུ་ཞི་བར་བྱེད་པར་རིག་པར་བྱ།
en: They should be regarded as guides, leaders, lamps, illuminators, and similarly as clarifiers, mentors, instructors, soothers, and peacemakers.

source: དགའ་བར་བྱེད་པ་དང་། རྒྱས་པར་བྱེད་པ་དང་སྔོན་དུ་འགྲོ་བ་དང་། མདུན་དུ་འགྲོ་བ་དང་། མཐར་བྱེད་པར་རིག་པར་བྱ།
en: They should be regarded as beings who bring joy, who enrich, who take the lead, who lead the way, and who bring things to an end.

source: སྒྲོལ་བ་དང་། ཕ་རོལ་དུ་འགྲོ་བ་དང་། འོད་བྱེད་པ་དང་། བདེ་བྱེད་དུ་རིག་པར་བྱ།
en: They should be regarded as liberated, as perfected, as illuminators, and as those who bring happiness.

source: གནས་དང་། མགོན་དང་། སྐྱབས་དང་། ཕ་རོལ་དུ་འགྲོ་བ་དང་། མི་འཇིགས་པར་བྱེད་པ་ཞེས་རིག་པར་བྱའོ། །
en: They should be regarded as a foundation, a protection, a refuge, as perfected, and as those who bestow fearlessness.

source: མཽད་གལ་གྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is this, Maudgalyāyana?

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་སེམས་ཅན་དེ་དག་ལས་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་སྟེ།
en: Because bodhisattvas derive their great compassion from these sentient beings, as they think,

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་མགོན་མེད་པ་སྟེ།
en: ‘Alas! These sentient beings have no protector.

source: ཁ་ཅིག་སྡུག་བསྔལ་ལས་ངེས་པར་འབྱུང་ཞིང་འདོད་པའི་བདེ་བ་འདོད།
en: Some of them wish to escape suffering and gain the pleasure of desire.

source: ཁ་ཅིག་ནི་སྡུག་བསྔལ་ལས་ངེས་པར་འབྱུང་ཞིང་། སྙོམས་པར་འཇུག་པའི་བདེ་བ་འདོད་པ་ནི་ལམ་རབ་ཏུ་ཉམས་པ། ལམ་གོལ་བར་ཞུགས་པ། ལམ་ངན་པའི་རྗེས་སུ་འབྲང་བའོ་སྙམ་མོ། །
en: Others wish to escape suffering and gain the pleasure of equilibrium. Thus they deviate from the path and go astray, ending up on inferior paths.’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། སྟོན་པ་དབེན་པར་སྤྱོད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there was a teacher known as Practicing Detachment.

source: དེ་སེམས་ཅན་རྣམས་འདོད་པའི་རབ་ཏུ་གནོད་པ་ལས་ངེས་པར་གྲོལ་བ་དང་། ངེས་པར་འབྱུང་བ་ལ་འཇོག་པར་བྱེད་དེ། དེས་དག་པར་ཡང་འཛིན་ཏོ། །
en: He was someone who led sentient beings to freedom and emancipation from the harm of sense pleasures and regarded that state as pure.

source: དེས་སྐྱེ་བོ་མང་པོ་ཡང་དག་པར་འཇོག་སྟེ། གང་གི་ཚེ་སེམས་ཅན་དག་འདོད་པ་རྣམས་ལ་དབེན་པ་འཐོབ་ཅིང་རེ་ཞིག་འདིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འདོད་དེ།
en: He led numerous beings to that state and when they became detached from sense pleasures, he would assert that in that moment they had reached nirvāṇa.

source: དེས་སྐྱེ་བོའི་ཚོགས་མང་པོ་འདོད་པ་ལས་དབེན་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus he was able to establish many of them fully in detachment from sense pleasures.

source: དེ་དག་ཀྱང་འདོད་པ་ལས་དབེན་པ་མཐར་ཕྱིན་ཏོ་སྙམ་པའི་འདུ་ཤེས་སུ་གྱུར་ཏོ། །
en: A number of them would then have the idea, ‘I am now perfectly detached from sense pleasures.’

source: གང་གི་ཚེ་སེམས་ཅན་རྣམས་འདོད་པ་ལས་དབེན་པ་སྐྱེ་བར་གྱུར་པ་དེའི་ཚེ། མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ་ཞེས་ཟེར་ཏེ། ཡང་ལུས་མི་སྐྱེད་དོ། །
en: When beings had become detached from sense pleasures, they were told they had achieved nirvāṇa, and that they would never take on a physical form again.

source: དེས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་བཟོད་པ་དེ་ལ་བཙུད་དེ་དེ་དག་ཐར་པའོ་སྙམ་པའི་འདུ་ཤེས་ཀྱི་འཆི་བའི་དུས་བྱས་ནས། ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་མཐོང་ངོ་། །
en: He established eighty million beings in this state of acceptance, and they all thought they were liberated. In such a frame of mind, after they died they were reborn in the realm of Brahmā.

source: དེ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ་འདི་ལྟ་སྟེ།
en: Witnessing that happen, they concluded,

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་འདི་ནི་ཆོས་ལོག་པའོ། །
en: ‘This so-called nirvāṇa is a perverted doctrine.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བའི་ལམ་འདི་ནི་ལམ་ལོག་པའོ་སྙམ་མོ། །
en: The path leading to this so-called nirvāṇa is a perverted path.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་མྱ་ངན་ལས་འདས་སོ་ཞེས་སྨྲ་བ་དེ་དག་ནི་ལོག་པར་སྨྲ་བ་ཡིན་ཏེ།
en: Any mendicants or brahmins who espouse such a doctrine of nirvāṇa are preaching falsehoods.’

source: དེ་དག་སྐྱེས་མ་ཐག་ཏུ་དེས་ཚངས་པའི་གཞལ་མེད་ཁང་མཐོང་བ་ཡང་མི་སྣང་བར་གྱུར་ཅིང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ། །
en: In fact, after they were born there, although they did see Brahmā’s celestial palace, it immediately vanished and they instead became beings in the great hells.

source: དེ་ལྟ་བས་ན་ལམ་གཞན་གྱིས་ཐར་བ་མ་གཏོགས་པར་འདོད་པ་ལས་ངེས་པར་འབྱུང་བ་ནི་ཐར་པ་མ་ཡིན་ནོ། །
en: This shows that while other paths may claim to lead directly to liberation, emancipation from sense pleasures is not liberation.

source: གང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཁ་ཅིག་ནི་བསམ་གཏན་གྱི་བདེ་བས་ཐར་པར་འདོད་པ་ཡང་ཡོད་དོ། །
en: “Some mendicants and brahmins hold that liberation can take place through the bliss of concentration.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་རིགས་མཆོག་མ་ཡིན་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there was a sage named Inferior Class.

source: དེ་འདོད་པ་རྣམས་ལ་འཆིང་བར་འདུ་ཤེས་ནས། འདོད་པ་སྤོང་ཞིང་འབྱུང་སྟེ།
en: He perceived sense pleasures to be fetters and so renounced them.

source: དེ་མངོན་པར་བྱུང་ནས་རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ་བསམ་གཏན་དང་པོ་ཐོབ་ནས་དེ་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: He took ordination and eventually achieved the first absorption level, with both conception and discernment. Then he thought,

source: གང་ལ་རྟོག་པ་དང་དཔྱོད་པ་དག་འཇུག་པའི་ས་འདི་ནི་རབ་ཏུ་མ་ཞི་བ་ཡིན་ཏེ། འདི་བས་ཅུང་ཞིག་གོང་ན་ཞི་བ་ཉིད་དང་། གྱ་ནོམ་པ་ཉིད་ཡོད་དོ་སྙམ་ནས་
en: ‘No matter what I direct my conception and discernment toward, I am not completely at peace. There must be something more tranquil and magnificent than this.’

source: དེས་བསམས་ཏེ་རྟོག་པ་མེད་པའི་བསམ་གཏན་ཐོབ་ནས་
en: With that in mind, he achieved a non-conceptual state of meditation.

source: དེ་འདི་སྙམ་དུ་གྱུར་ཏེགང་ལ་རྟོག་པ་དང་དཔྱོད་པ་དག་མི་འབྱུང་བ་འདི་ནི། མྱ་ངན་ལས་འདས་པ་ཡིན་ཏེ།
en: Then he thought to himself, ‘There is no longer any conception or discernment—this must be nirvāṇa.

source: འདི་ནི་ཞི་བའོ། །འདི་ནི་གྱ་ནོམ་པའོ། །
en: It is so tranquil and magnificent .

source: གང་ལ་རྟོག་པ་དང་དཔྱོད་པ་དག་མེད་པ་དེ་ཡང་དང་ཡང་དུ་སྐྱེ་བར་མི་འཇུག་ལ་ཉེ་བར་ལེན་པ་ཅུང་ཟད་ཀྱང་མེད་དེ་འདི་ནི་ཕུང་པོ་ལྷག་མ་མེད་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་འདའོ་སྙམ་ནས་
en: Without conception or discernment there is no need to continue to reincarnate—there is no longer the slightest appropriation, and so I have passed into nirvāṇa in the realm without remainder.’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནསསྲོག་ཆགས་འབུམ་ཕྲག་དྲུག་བཟོད་པ་འདི་ལ་བཙུད་དོ། །
en: Emerging from his state of absorption, he went on to establish six hundred thousand beings in the same state of acceptance.

source: དེ་དག་ཀྱང་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: Each of them also thought,
